//Напишите программу, которая на вход принимает два числа и проверяет, 
//является ли первое число квадратом второго.

int a = -3;
int b = 9;
if (a * a == b)
Console.Write("Yes");
else
Console.Write("No");

