//Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.
int a = -3;
int b = -9;
if (a < b)
{ 
    Console.Write("min = ");
    Console.WriteLine(a);
    Console.Write("max = ");
    Console.WriteLine(b);
}
else
{
    Console.Write("min = ");
    Console.WriteLine(b);
    Console.Write("max = ");
    Console.WriteLine(a);  
}
