// Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).

int a = 7;

if (a % 2 == 0)
{
    Console.WriteLine("Число делится на 2 без остатка");
}
else
{
    Console.WriteLine("Число делится на 2 с остатком");    
}